RafasLectures/advanced-microtech/mock/msp430g2553.cpp
#include "msp430g2553.h"
#include <cstdint>

#define DECLARE_8BIT_REGISTER(regName, initValue)  volatile uint8_t regName = initValue;
#define DECLARE_16BIT_REGISTER(regName, initValue) volatile uint16_t regName = initValue;

DECLARE_8BIT_REGISTER(P1DIR, 0)
DECLARE_8BIT_REGISTER(P1IN, 0)
DECLARE_8BIT_REGISTER(P1OUT, 0)
DECLARE_8BIT_REGISTER(P1REN, 0)
DECLARE_8BIT_REGISTER(P1SEL, 0)
DECLARE_8BIT_REGISTER(P1SEL2, 0)
DECLARE_8BIT_REGISTER(P1IE, 0)
DECLARE_8BIT_REGISTER(P1IES, 0)
DECLARE_8BIT_REGISTER(P1IFG, 0)
DECLARE_8BIT_REGISTER(P2DIR, 0)
DECLARE_8BIT_REGISTER(P2IN, 0)
DECLARE_8BIT_REGISTER(P2OUT, 0)
DECLARE_8BIT_REGISTER(P2REN, 0)
DECLARE_8BIT_REGISTER(P2SEL, 0)
DECLARE_8BIT_REGISTER(P2SEL2, 0)
DECLARE_8BIT_REGISTER(P2IE, 0)
DECLARE_8BIT_REGISTER(P2IES, 0)
DECLARE_8BIT_REGISTER(P2IFG, 0)
DECLARE_16BIT_REGISTER(TA0CCR0, 0)
DECLARE_16BIT_REGISTER(TA0CCTL0, 0)
DECLARE_16BIT_REGISTER(TA0CTL, 0)

DECLARE_8BIT_REGISTER(ADC10AE0,0)
DECLARE_8BIT_REGISTER(ADC10DTC0,0)
DECLARE_8BIT_REGISTER(ADC10DTC1,0)
DECLARE_16BIT_REGISTER(ADC10CTL0,0)
DECLARE_16BIT_REGISTER(ADC10CTL1,0)
DECLARE_16BIT_REGISTER(ADC10MEM,0)
DECLARE_16BIT_REGISTER(ADC10SA,0)


